# Создание столбцов на ходу
- Лена - разработчик
- Ваня - дизайнер
- Настя - редактор

In [ ]:
staff = {
    'Лена': 'менеджеры',
    'Ваня': 'дизайнеры',
}

In [1]:
import pandas as pd

In [19]:
def departments(row):
    dict_ = row['dicts']
    print(dict_)
    
    if 'Лена' in dict_:
        row['разработка'] = dict_['Лена']
        
    if 'Ваня' in dict_:
        row['дизайнер'] = dict_['Ваня']
        
    if 'Настя' in dict_:
        row['редакторы'] = dict_['Настя']
    
    return row

In [24]:
df.apply(departments, axis=1)  # .fillna(0)

{'Лена': 1, 'Ваня': 2}
{'Ваня': 3, 'Леша': 5}
{'Настя': 3}

                    dicts  дизайнер  разработка  редакторы
0  {'Лена': 1, 'Ваня': 2}       2.0         1.0        NaN
1  {'Ваня': 3, 'Леша': 5}       3.0         NaN        NaN
2            {'Настя': 3}       NaN         NaN        3.0

In [21]:
df = pd.DataFrame({'dicts': [{'Лена': 1, 'Ваня': 2}, {'Ваня': 3, 'Леша': 5}, {'Настя': 3}]})
df

                    dicts
0  {'Лена': 1, 'Ваня': 2}
1  {'Ваня': 3, 'Леша': 5}
2            {'Настя': 3}

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dicts   3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes

# Группировки
Заполнение пропусков и оконные функции

In [25]:
df = pd.DataFrame(
    {
        'city': ['Новосибирск', 'Новосибирск', 'Владивосток', 'Новосибирск', 'Владивосток', 'Владивосток', 'Владивосток', 'Владивосток', 'Новосибирск', 'Владивосток'],
        'sales': [140, 135, 290, 95, 100, 50, 40, 120, 190, 200],
    }
)
df

          city  sales
0  Новосибирск    140
1  Новосибирск    135
2  Владивосток    290
3  Новосибирск     95
4  Владивосток    100
5  Владивосток     50
6  Владивосток     40
7  Владивосток    120
8  Новосибирск    190
9  Владивосток    200

In [28]:
df[df['city'] == 'Новосибирск']['sales'].sum()

560

In [29]:
df[df['city'] == 'Владивосток']['sales'].sum()

800

In [30]:
df.groupby('city').sum()

             sales
city
Владивосток    800
Новосибирск    560

In [32]:
df.groupby('city').sum().reset_index()

          city  sales
0  Владивосток    800
1  Новосибирск    560

In [36]:
df.groupby('city').agg(['sum', 'min', 'max'])

            sales
              sum min  max
city
Владивосток   800  40  290
Новосибирск   560  95  190

In [37]:
df.groupby('city').agg({'sales': 'min'})

             sales
city
Владивосток     40
Новосибирск     95

In [39]:
df_for_city = df[df['city'] == 'Новосибирск']  # на вход функции подается такой датафрейм
df_for_city

          city  sales
0  Новосибирск    140
1  Новосибирск    135
3  Новосибирск     95
8  Новосибирск    190

In [43]:
df_for_city['sales'].max() - df_for_city['sales'].min()

95

In [42]:
df_for_city['sales'].min()

95

In [44]:
def min_max(df_for_city):  # датафрейм с определенным городом
    return df_for_city['sales'].max() - df_for_city['sales'].min()

In [46]:
df.groupby('city')

In [45]:
df.groupby('city').apply(min_max)

city
Владивосток    250
Новосибирск     95
dtype: int64

Хотим посчитать процент строки от ее региона

In [48]:
df.sort_values('city')

          city  sales
2  Владивосток    290
4  Владивосток    100
5  Владивосток     50
6  Владивосток     40
7  Владивосток    120
9  Владивосток    200
0  Новосибирск    140
1  Новосибирск    135
3  Новосибирск     95
8  Новосибирск    190

In [49]:
df_for_city = df[df['city'] == 'Новосибирск']  # на вход функции подается такой датафрейм
df_for_city

          city  sales
0  Новосибирск    140
1  Новосибирск    135
3  Новосибирск     95
8  Новосибирск    190

In [51]:
140 + 135 + 95 +190

560

In [50]:
sum_for_city = df_for_city['sales'].sum()
sum_for_city

560

In [52]:
df_for_city['share'] = df_for_city['sales'] / sum_for_city
df_for_city

<ipython-input-52-11f579cc6140>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_for_city['share'] = df_for_city['sales'] / sum_for_city

          city  sales     share
0  Новосибирск    140  0.250000
1  Новосибирск    135  0.241071
3  Новосибирск     95  0.169643
8  Новосибирск    190  0.339286

In [53]:
def share(df_for_city):
    sum_for_city = df_for_city['sales'].sum()
    df_for_city['share'] = df_for_city['sales'] / sum_for_city
    
    return df_for_city

In [56]:
df.sort_values('city').groupby('city').apply(share)

          city  sales     share
2  Владивосток    290  0.362500
4  Владивосток    100  0.125000
5  Владивосток     50  0.062500
6  Владивосток     40  0.050000
7  Владивосток    120  0.150000
9  Владивосток    200  0.250000
0  Новосибирск    140  0.250000
1  Новосибирск    135  0.241071
3  Новосибирск     95  0.169643
8  Новосибирск    190  0.339286

Если ключей больше

In [60]:
df = pd.DataFrame(
    {
        'city': ['Новосибирск', 'Томск', 'Владивосток', 'Новосибирск', 'Владивосток', 'Владивосток', 'Владивосток', 'Владивосток', 'Томск', 'Владивосток'],
        'region': ['СФО', 'СФО', 'ДВФО', 'СФО', 'ДВФО', 'ДВФО', 'ДВФО', 'ДВФО', 'СФО', 'ДВФО'],
        'sales': [140, 135, 290, 95, 100, 50, 40, 120, 190, 200],
    }
)
df

          city region  sales
0  Новосибирск    СФО    140
1        Томск    СФО    135
2  Владивосток   ДВФО    290
3  Новосибирск    СФО     95
4  Владивосток   ДВФО    100
5  Владивосток   ДВФО     50
6  Владивосток   ДВФО     40
7  Владивосток   ДВФО    120
8        Томск    СФО    190
9  Владивосток   ДВФО    200

In [62]:
df.sort_values('city').groupby(['region']).apply(share)  # сумма 100% для каждого региона

          city region  sales     share
2  Владивосток   ДВФО    290  0.362500
4  Владивосток   ДВФО    100  0.125000
5  Владивосток   ДВФО     50  0.062500
6  Владивосток   ДВФО     40  0.050000
7  Владивосток   ДВФО    120  0.150000
9  Владивосток   ДВФО    200  0.250000
0  Новосибирск    СФО    140  0.250000
3  Новосибирск    СФО     95  0.169643
1        Томск    СФО    135  0.241071
8        Томск    СФО    190  0.339286

In [63]:
df.sort_values('city').groupby(['city', 'region']).apply(share)  # сумма 100% для каждого региона + города

          city region  sales     share
2  Владивосток   ДВФО    290  0.362500
4  Владивосток   ДВФО    100  0.125000
5  Владивосток   ДВФО     50  0.062500
6  Владивосток   ДВФО     40  0.050000
7  Владивосток   ДВФО    120  0.150000
9  Владивосток   ДВФО    200  0.250000
0  Новосибирск    СФО    140  0.595745
3  Новосибирск    СФО     95  0.404255
1        Томск    СФО    135  0.415385
8        Томск    СФО    190  0.584615